from langchain.text_splitter import CharacterTextSplitter
import re
from typing import List
from configs.model_config import SENTENCE_SIZE


class ChineseTextSplitter(CharacterTextSplitter):
    def __init__(self, pdf: bool = False, sentence_size: int = SENTENCE_SIZE, **kwargs):
        super().__init__(**kwargs)
        self.pdf = pdf
        self.sentence_size = sentence_size

    def split_text1(self, text: str) -> List[str]:
        if self.pdf:
            text = re.sub(r"\n{3,}", "\n", text)
            text = re.sub('\s', ' ', text)
            text = text.replace("\n\n", "")
        sent_sep_pattern = re.compile('([﹒﹔﹖﹗．。！？]["’”」』]{0,2}|(?=["‘“「『]{1,2}|$))')  # del ：；
        sent_list = []
        for ele in sent_sep_pattern.split(text):
            if sent_sep_pattern.match(ele) and sent_list:
                sent_list[-1] += ele
            elif ele:
                sent_list.append(ele)
        return sent_list

    def split_text(self, text: str) -> List[str]:   ##此处需要进一步优化逻辑
        if self.pdf:
            text = re.sub(r"\n{3,}", r"\n", text)
            text = re.sub('\s', " ", text)
            text = re.sub("\n\n", "", text)

        text = re.sub(r'([;；.!?。！？\?])([^”’])', r"\1\n\2", text)  # 单字符断句符
        text = re.sub(r'(\.{6})([^"’”」』])', r"\1\n\2", text)  # 英文省略号
        text = re.sub(r'(\…{2})([^"’”」』])', r"\1\n\2", text)  # 中文省略号
        text = re.sub(r'([;；!?。！？\?]["’”」』]{0,2})([^;；!?，。！？\?])', r'\1\n\2', text)
        # 如果双引号前有终止符，那么双引号才是句子的终点，把分句符\n放到双引号后，注意前面的几句都小心保留了双引号
        text = text.rstrip()  # 段尾如果有多余的\n就去掉它
        # 很多规则中会考虑分号;，但是这里我把它忽略不计，破折号、英文双引号等同样忽略，需要的再做些简单调整即可。
        ls = [i for i in text.split("\n") if i]
        for ele in ls:
            if len(ele) > self.sentence_size:
                ele1 = re.sub(r'([,，.]["’”」』]{0,2})([^,，.])', r'\1\n\2', ele)
                ele1_ls = ele1.split("\n")
                for ele_ele1 in ele1_ls:
                    if len(ele_ele1) > self.sentence_size:
                        ele_ele2 = re.sub(r'([\n]{1,}| {2,}["’”」』]{0,2})([^\s])', r'\1\n\2', ele_ele1)
                        ele2_ls = ele_ele2.split("\n")
                        for ele_ele2 in ele2_ls:
                            if len(ele_ele2) > self.sentence_size:
                                ele_ele3 = re.sub('( ["’”」』]{0,2})([^ ])', r'\1\n\2', ele_ele2)
                                ele2_id = ele2_ls.index(ele_ele2)
                                ele2_ls = ele2_ls[:ele2_id] + [i for i in ele_ele3.split("\n") if i] + ele2_ls[
                                                                                                       ele2_id + 1:]
                        ele_id = ele1_ls.index(ele_ele1)
                        ele1_ls = ele1_ls[:ele_id] + [i for i in ele2_ls if i] + ele1_ls[ele_id + 1:]

                id = ls.index(ele)
                ls = ls[:id] + [i for i in ele1_ls if i] + ls[id + 1:]
        return ls

    def split_text_v2(self, text: str) -> List[str]:   ##此处需要进一步优化逻辑
        if self.pdf:
            text = re.sub(r"\n{3,}", r"\n", text)
            text = re.sub('\s', " ", text)
            text = re.sub("\n\n", "", text)

        text = re.sub(r'([;；.!?。！？\?])([^”’])', r"\1\n\2", text)  # 单字符断句符
        # text = re.sub(r'(\.{6})([^"’”」』])', r"\1\n\2", text)  # 英文省略号
        # text = re.sub(r'(\…{2})([^"’”」』])', r"\1\n\2", text)  # 中文省略号
        text = re.sub(r'([;；!?。！？\?]["’”」』]{0,2})([^;；!?，。！？\?])', r'\1\n\2', text)
        # 如果双引号前有终止符，那么双引号才是句子的终点，把分句符\n放到双引号后，注意前面的几句都小心保留了双引号
        text = text.rstrip()  # 段尾如果有多余的\n就去掉它
        # 很多规则中会考虑分号;，但是这里我把它忽略不计，破折号、英文双引号等同样忽略，需要的再做些简单调整即可。
        ls = [i for i in text.split("\n") if i]
        for ele in ls:
            if len(ele) > self.sentence_size:
                ele1 = re.sub(r'([,，.]["’”」』]{0,2})([^,，.])', r'\1\n\2', ele)
                ele1_ls = ele1.split("\n")
                for ele_ele1 in ele1_ls:
                    if len(ele_ele1) > self.sentence_size:
                        ele_ele2 = re.sub(r'([\n]{1,}| {2,}["’”」』]{0,2})([^\s])', r'\1\n\2', ele_ele1)
                        ele2_ls = ele_ele2.split("\n")
                        for ele_ele2 in ele2_ls:
                            if len(ele_ele2) > self.sentence_size:
                                ele_ele3 = re.sub('( ["’”」』]{0,2})([^ ])', r'\1\n\2', ele_ele2)
                                ele2_id = ele2_ls.index(ele_ele2)
                                ele2_ls = ele2_ls[:ele2_id] + [i for i in ele_ele3.split("\n") if i] + ele2_ls[
                                                                                                       ele2_id + 1:]
                        ele_id = ele1_ls.index(ele_ele1)
                        ele1_ls = ele1_ls[:ele_id] + [i for i in ele2_ls if i] + ele1_ls[ele_id + 1:]

                id = ls.index(ele)
                ls = ls[:id] + [i for i in ele1_ls if i] + ls[id + 1:]
        return ls

if __name__ == '__main__':
    text="很多规则中会考虑分号;，但是这里我把它忽略不计，............破折号、英文双引号等同样忽略，需要的再做些简单调整即可。"
    text="江苏安靠智能输电工程科技股份有限公司2021年年度报告全文江苏安靠智能输电工程科技股份有限公司2021年年度报告2022-0202022年03月1江苏安靠智能输电工程科技股份有限公司2021年年度报告全文第一节重要提示、目录和释义公司董事会、监事会及董事、监事、高级管理人员保证年度报告内容的真实、准确、完整，不存在虚假记载、误导性陈述或者重大遗漏，并承担个别和连带的法律>责任。公司负责人陈晓晖、主管会计工作负责人陈晓凌及会计机构负责人(会计主管人员)王春梅声明：保证本年度报告中财务报告的真实、准确、完整。所有董事均已出席了审议本报告的董事会会>议。本报告中如有涉及未来的计划、业绩预测等方面内容，均不构成公司对任何投资者及相关人士的承诺，投资者及相关人士均应当对此保持足够的风险认识，并且应当理解计划、预测与承诺之间>的差异。公司在本年度报告中详细阐述了未来可能发生的有关风险因素及对策，详见“第三节管理层讨论与分析”之“十一、公司未来发展的展望”中的“（三）未来发展面临的主要风险”，敬请广大投>资者予以关注。公司经本次董事会审议通过的利润分配预案为：以167,996,636股为基数，向全体股东每10股派发现金红利5.00元（含税），送红股0股（含税），以资本公积金向全体股东每10股转>增0股。2江苏安靠智能输电工程科技股份有限公司2021年年度报告全文目录第一节重要提示、目录和释义.......................................................................................................2第二节公司简介和主要财务指标...................................................................................................7第三节管理层讨论与分析.............................................................................................................11第四节公司治理..............................................................................................................................36第五节环境和社会责任.................................................................................................................55第六节重要事项..............................................................................................................................57第七节股份变动及股东情况.........................................................................................................70第八节优先股相关情况.................................................................................................................78第九节债券相关情况.....................................................................................................................79第十节财务报告..............................................................................................................................803江苏安靠智能输电工程科技股份有限公司2021年年度报告全文备查文件目录1、载有公司法定代表人签名的2021年度报告全文的原件；2、载有公司负责人>、主管会计工作负责人、会计机构负责人签名并盖章的财务报表；3、载有会计师事务所盖章、注册会计师签名并盖章的审计报告原件；4、报告期内在中国证监会指定网站上公开披露过的所有文件>的正本及公告原稿；5、其他备查文件。以上备查文件的备置地点：江苏省溧阳市天目湖大道100号公司董事会办公室4江苏安靠智能输电工程科技股份有限公司2021年年度报告全文释义['释义项', '指', '释义内容']['一、简称', '指', '']['安靠智电、本公司、公司、发行人', '指', '江苏安靠智能输电工程科技股份有限公司']['河南安靠', '指', '河南安靠电力工程设计有限公司，公司>的控股子公司']['溧阳常瑞', '指', '溧阳市常瑞电力科技有限公司，公司的全资子公司']['江苏凌瑞', '指', '江苏凌瑞电力科技有限公司，公司的全资子公司']['安靠创投', '指', '江苏安靠>创业投资有限公司，公司的全资子公司']['安云创投', '指', '江苏安云创业投资有限公司，安靠创投的控股子公司']['安靠有限', '指', '江苏安靠超高压电缆附件有限公司']['安靠光热', '指', '江苏安靠光热发电系统科技有限公司']['安靠电站', '指', '江苏安靠智能电站科技有限公司，公司的控股子公司']['数字能源', '指', '江苏安靠数字能源科技有限公司，江苏凌瑞的控股子公司']['天目湖电动', '指', '江苏天目湖电动科技有限公司，公司的控股子公司']['国家电网', '指', '国家电网有限公司']['南方电网', '指', '中国南方电网有限责任公司']['', '', '中国华>能集团有限公司、中国电力投资集团公司（后并入国家电力投资集团有限公司）、中国大唐集团有限公司、中国国电集团有限']['五大发电集团', '指', '公司（后并入国家能源投资集团有限责任>公司）和中国华电集团有']['', '', '限公司']['中国证监会、证监会', '指', '中国证券监督管理委员会']['深交所', '指', '深圳证券交易所']['公司法', '指', '中华人民共和国公司法']['>证券法', '指', '中华人民共和国证券法']['股东大会', '指', '江苏安靠智能输电工程科技股份有限公司股东大会']['董事会', '指', '江苏安靠智能输电工程科技股份有限公司董事会']['监事>会', '指', '江苏安靠智能输电工程科技股份有限公司监事会']['公司章程', '指', '江苏安靠智能输电工程科技股份有限公司章程']['报告期', '指', '2021年1月1日至2021年12月31日']['二、>专业术语', '指', '']['中低压', '指', '66kV 以下']5江苏安靠智能输电工程科技股份有限公司2021年年度报告全文['高压', '指', '66kV（含）至 220kV（含）']['超高压', '指', '220kV 以>上至 750kV（含）']['特高压', '指', '750kV 以上']['', '', '由变电站、配电站、电力线路（包括电缆）和其他供电设施所组成']['电网', '指', '的供电网络']['', '', '以坚强网架为基础>，以通信信息平台为支撑，以智能控制为手段，包含电力系统的发电、输电、变电、配电、用电和调度各个环节，']['智能电网', '指', '覆盖所有电压等级，实现“电力流、信息流、业务流”的高>度一体']['', '', '化融合的现代电网']['', '', '包含城市变电站与IDC变电站解决方案，以一、二次融合的智能设']['智慧模块化变电站', '指', '备为模块，通过工厂化生产预制、现场模块化装配建设变电站']['', '', '依据电缆结构的特性，既能恢复电缆的性能，又可保证电缆长度的']['电缆连接件', '指', '延长及终端的连接']['', '', '气体绝缘金属封闭开关设备，利用SF 作为绝缘介质，将电器元件6']['GIS', '指', '采用积木式结构组合在一起，并全部封闭在金属外壳内']['', '', '气体绝缘输电线路，一种采用SF 等气体绝缘、外壳与导体同轴布6']['GIL', '指', '置的高电压、大电流、长距离电力传输设备']['', '', '把三根导体装入一个管道内，取代原来三根导体各放一个管道的设']['三相共箱', '指', '计，占用空间由此减小了近1/3']['', '', '电缆连接件的一种，通常在受阳光直接照射或暴露在气候环境下或']['户外终端', '指', '二者都存在的情况下使用，主要用于电缆和架空线路之间的连接']6江苏安靠智能输电工程科技股份有限公司2021年年度报告全文第二节公司简介和主要财务指标一、公司信息['股票简称', '', '安靠智电', '股票代码', '300617']['公司的中文名称', '江苏安靠智能输电工程科技股份有限公司', '', '', '']['公司的中文简称', '', '安靠智电', '', '']['公司的外文名称（如有）', '', 'Jiangsu Ankura Smart Transmission Engineering Technology Co.Ltd', '', '']['公司的法定代表人', '>陈晓晖', '', '', '']['注册地址', '', '溧阳市经济开发区天目湖工业园', '', '']['注册地址的邮政编码', '', '213300', '', '']['公司注册地址历史变更情况', '', '不适用', '', '']['>办公地址', '', '江苏省溧阳市天目湖大道 100 号', '', '']['办公地址的邮政编码', '', '213300', '', '']['公司国际互联网网址', '', 'www.ankura.com.cn', '', '']['电子信箱', '', 'stock@ankura.com.cn', '', '']二、联系人和联系方式['', '董事会秘书', '证券事务代表']['姓名', '陈晓晖', '李莉']['联系地址', '江苏省溧阳市天目湖大道 100 号', '江苏省溧阳市天目湖大道 100 号']['电话', '0519-87983616', '0519-87983616']['传真', '0519-87982668-9999', '0519-87982668-9999']['电子信箱', 'stock@ankura.com.cn', 'stock@ankura.com.cn']"
    cts = ChineseTextSplitter()
    text_splits = cts.split_text_v2(text)
    for line in text_splits:
        print(line)
